/* 
  Problem 6
  ----------

  [Hints]
  আমরা লুপের মাধ্যমে ১৮০০ থেকে ২০০০ সাল পর্যন্ত প্রতিটি সাল চেক করবো যে, সাল টি leap year কিনা। 
  Leap Year হওয়ার শর্ত দুটি, 
  (i) প্রথমে আমরা চেক করবো year টি কি 400 দিয়ে নিঃশেষে বিভাজ্য কিনা। 
  (ii) নাহলে, আমরা চেক করবো, year টি কি 4 দিয়ে বিভাজ্য কিনা এবং 100 দিয়ে অবিভাজ্য কিনা। 
  এই দুটো শর্তের যেকোনো একটি মানলে ইয়ারটি লিপ ইয়ার।

  */

for (let year = 1800; year <= 2000; year++) {
  if (year % 400 === 0) {
    console.log(`${year} is a leap year`);
  } else if (year % 4 === 0 && year % 100 !== 0) {
    console.log(`${year} is a leap year`);
  }
}

// আমরা চাইলে if .. else if না লিখে একটি if এর মাধ্যমেই এই কাজটি করতে পারতাম। চেষ্টা করে দেখুন।
